Plan

```

14:41:59.292 STDOUT terraform: Terraform will perform the following actions:
14:41:59.292 STDOUT terraform:   # aws_identitystore_group.infra will be updated in-place
14:41:59.292 STDOUT terraform:   ~ resource "aws_identitystore_group" "infra" {
14:41:59.292 STDOUT terraform:       + description       = "The infrastructure team"
14:41:59.292 STDOUT terraform:         id                = "d-9067bc86ef/e40884a8-9021-7098-ba89-1f2ab32bab88"
14:41:59.293 STDOUT terraform:         # (4 unchanged attributes hidden)
14:41:59.293 STDOUT terraform:     }
14:41:59.293 STDOUT terraform:   # aws_identitystore_group.infra-admins will be updated in-place
14:41:59.293 STDOUT terraform:   ~ resource "aws_identitystore_group" "infra-admins" {
14:41:59.293 STDOUT terraform:       + description       = "The administrators of the Rust organization"
14:41:59.293 STDOUT terraform:         id                = "d-9067bc86ef/f4880468-0021-707f-2472-306e771fd1ea"
14:41:59.293 STDOUT terraform:         # (4 unchanged attributes hidden)
14:41:59.293 STDOUT terraform:     }
14:41:59.293 STDOUT terraform:   # aws_organizations_account.sync_team_prod will be created
14:41:59.293 STDOUT terraform:   + resource "aws_organizations_account" "sync_team_prod" {
14:41:59.293 STDOUT terraform:       + arn               = (known after apply)
14:41:59.293 STDOUT terraform:       + close_on_deletion = false
14:41:59.293 STDOUT terraform:       + create_govcloud   = false
14:41:59.293 STDOUT terraform:       + email             = "admin+sync-team-prod@rust-lang.org"
14:41:59.293 STDOUT terraform:       + govcloud_id       = (known after apply)
14:41:59.293 STDOUT terraform:       + id                = (known after apply)
14:41:59.293 STDOUT terraform:       + joined_method     = (known after apply)
14:41:59.293 STDOUT terraform:       + joined_timestamp  = (known after apply)
14:41:59.293 STDOUT terraform:       + name              = "sync-team-prod"
14:41:59.293 STDOUT terraform:       + parent_id         = (known after apply)
14:41:59.293 STDOUT terraform:       + status            = (known after apply)
14:41:59.293 STDOUT terraform:       + tags_all          = (known after apply)
14:41:59.293 STDOUT terraform:     }
14:41:59.293 STDOUT terraform:   # module.sso_account_assignment["dev-desktops-prod"].aws_ssoadmin_account_assignment.account_group_permission["infra-admins[ReadOnlyAccess]"] will be created
14:41:59.295 STDOUT terraform:   + resource "aws_ssoadmin_account_assignment" "account_group_permission" {
14:41:59.295 STDOUT terraform:       + id                 = (known after apply)
14:41:59.295 STDOUT terraform:       + instance_arn       = "arn:aws:sso:::instance/ssoins-72236e90633f0325"
14:41:59.295 STDOUT terraform:       + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-72236e90633f0325/ps-f251e64aceea4752"
14:41:59.295 STDOUT terraform:       + principal_id       = "f4880468-0021-707f-2472-306e771fd1ea"
14:41:59.295 STDOUT terraform:       + principal_type     = "GROUP"
14:41:59.295 STDOUT terraform:       + target_id          = "826384318366"
14:41:59.296 STDOUT terraform:       + target_type        = "AWS_ACCOUNT"
14:41:59.296 STDOUT terraform:     }
14:41:59.296 STDOUT terraform:   # module.sso_account_assignment["dev-desktops-prod"].aws_ssoadmin_account_assignment.account_group_permission["infra-admins[ViewOnlyAccess]"] will be destroyed
14:41:59.296 STDOUT terraform:   # (because key ["infra-admins[ViewOnlyAccess]"] is not in for_each map)
14:41:59.296 STDOUT terraform:   - resource "aws_ssoadmin_account_assignment" "account_group_permission" {
14:41:59.296 STDOUT terraform:       - id                 = "f4880468-0021-707f-2472-306e771fd1ea,GROUP,826384318366,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-72236e90633f0325/ps-15e41bbf18a7dd68,arn:aws:sso:::instance/ssoins-72236e90633f0325" -> null
14:41:59.296 STDOUT terraform:       - instance_arn       = "arn:aws:sso:::instance/ssoins-72236e90633f0325" -> null
14:41:59.296 STDOUT terraform:       - permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-72236e90633f0325/ps-15e41bbf18a7dd68" -> null
14:41:59.296 STDOUT terraform:       - principal_id       = "f4880468-0021-707f-2472-306e771fd1ea" -> null
14:41:59.296 STDOUT terraform:       - principal_type     = "GROUP" -> null
14:41:59.296 STDOUT terraform:       - target_id          = "826384318366" -> null
14:41:59.296 STDOUT terraform:       - target_type        = "AWS_ACCOUNT" -> null
14:41:59.296 STDOUT terraform:     }
14:41:59.296 STDOUT terraform:   # module.sso_account_assignment["dev-desktops-prod"].aws_ssoadmin_account_assignment.account_group_permission["infra[ReadOnlyAccess]"] will be created
14:41:59.296 STDOUT terraform:   + resource "aws_ssoadmin_account_assignment" "account_group_permission" {
14:41:59.296 STDOUT terraform:       + id                 = (known after apply)
14:41:59.296 STDOUT terraform:       + instance_arn       = "arn:aws:sso:::instance/ssoins-72236e90633f0325"
14:41:59.296 STDOUT terraform:       + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-72236e90633f0325/ps-f251e64aceea4752"
14:41:59.296 STDOUT terraform:       + principal_id       = "e40884a8-9021-7098-ba89-1f2ab32bab88"
14:41:59.296 STDOUT terraform:       + principal_type     = "GROUP"
14:41:59.296 STDOUT terraform:       + target_id          = "826384318366"
14:41:59.297 STDOUT terraform:       + target_type        = "AWS_ACCOUNT"
14:41:59.297 STDOUT terraform:     }
14:41:59.297 STDOUT terraform:   # module.sso_account_assignment["dev-desktops-prod"].aws_ssoadmin_account_assignment.account_group_permission["infra[ViewOnlyAccess]"] will be destroyed
14:41:59.297 STDOUT terraform:   # (because key ["infra[ViewOnlyAccess]"] is not in for_each map)
14:41:59.297 STDOUT terraform:   - resource "aws_ssoadmin_account_assignment" "account_group_permission" {
14:41:59.297 STDOUT terraform:       - id                 = "e40884a8-9021-7098-ba89-1f2ab32bab88,GROUP,826384318366,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-72236e90633f0325/ps-15e41bbf18a7dd68,arn:aws:sso:::instance/ssoins-72236e90633f0325" -> null
14:41:59.297 STDOUT terraform:       - instance_arn       = "arn:aws:sso:::instance/ssoins-72236e90633f0325" -> null
14:41:59.297 STDOUT terraform:       - permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-72236e90633f0325/ps-15e41bbf18a7dd68" -> null
14:41:59.297 STDOUT terraform:       - principal_id       = "e40884a8-9021-7098-ba89-1f2ab32bab88" -> null
14:41:59.297 STDOUT terraform:       - principal_type     = "GROUP" -> null
14:41:59.297 STDOUT terraform:       - target_id          = "826384318366" -> null
14:41:59.297 STDOUT terraform:       - target_type        = "AWS_ACCOUNT" -> null
14:41:59.297 STDOUT terraform:     }
14:41:59.297 STDOUT terraform:   # module.sso_account_assignment["docs-rs-staging"].aws_ssoadmin_account_assignment.account_group_permission["infra-admins[ReadOnlyAccess]"] will be created
14:41:59.297 STDOUT terraform:   + resource "aws_ssoadmin_account_assignment" "account_group_permission" {
14:41:59.297 STDOUT terraform:       + id                 = (known after apply)
14:41:59.297 STDOUT terraform:       + instance_arn       = "arn:aws:sso:::instance/ssoins-72236e90633f0325"
14:41:59.297 STDOUT terraform:       + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-72236e90633f0325/ps-f251e64aceea4752"
14:41:59.297 STDOUT terraform:       + principal_id       = "f4880468-0021-707f-2472-306e771fd1ea"
14:41:59.297 STDOUT terraform:       + principal_type     = "GROUP"
14:41:59.297 STDOUT terraform:       + target_id          = "519825364412"
14:41:59.297 STDOUT terraform:       + target_type        = "AWS_ACCOUNT"
14:41:59.298 STDOUT terraform:     }
14:41:59.298 STDOUT terraform:   # module.sso_account_assignment["docs-rs-staging"].aws_ssoadmin_account_assignment.account_group_permission["infra-admins[ViewOnlyAccess]"] will be destroyed
14:41:59.298 STDOUT terraform:   # (because key ["infra-admins[ViewOnlyAccess]"] is not in for_each map)
14:41:59.298 STDOUT terraform:   - resource "aws_ssoadmin_account_assignment" "account_group_permission" {
14:41:59.298 STDOUT terraform:       - id                 = "f4880468-0021-707f-2472-306e771fd1ea,GROUP,519825364412,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-72236e90633f0325/ps-15e41bbf18a7dd68,arn:aws:sso:::instance/ssoins-72236e90633f0325" -> null
14:41:59.298 STDOUT terraform:       - instance_arn       = "arn:aws:sso:::instance/ssoins-72236e90633f0325" -> null
14:41:59.298 STDOUT terraform:       - permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-72236e90633f0325/ps-15e41bbf18a7dd68" -> null
14:41:59.298 STDOUT terraform:       - principal_id       = "f4880468-0021-707f-2472-306e771fd1ea" -> null
14:41:59.298 STDOUT terraform:       - principal_type     = "GROUP" -> null
14:41:59.298 STDOUT terraform:       - target_id          = "519825364412" -> null
14:41:59.298 STDOUT terraform:       - target_type        = "AWS_ACCOUNT" -> null
14:41:59.298 STDOUT terraform:     }
14:41:59.298 STDOUT terraform:   # module.sso_account_assignment["docs-rs-staging"].aws_ssoadmin_account_assignment.account_group_permission["infra[ReadOnlyAccess]"] will be created
14:41:59.298 STDOUT terraform:   + resource "aws_ssoadmin_account_assignment" "account_group_permission" {
14:41:59.298 STDOUT terraform:       + id                 = (known after apply)
14:41:59.298 STDOUT terraform:       + instance_arn       = "arn:aws:sso:::instance/ssoins-72236e90633f0325"
14:41:59.298 STDOUT terraform:       + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-72236e90633f0325/ps-f251e64aceea4752"
14:41:59.298 STDOUT terraform:       + principal_id       = "e40884a8-9021-7098-ba89-1f2ab32bab88"
14:41:59.298 STDOUT terraform:       + principal_type     = "GROUP"
14:41:59.298 STDOUT terraform:       + target_id          = "519825364412"
14:41:59.298 STDOUT terraform:       + target_type        = "AWS_ACCOUNT"
14:41:59.298 STDOUT terraform:     }
14:41:59.298 STDOUT terraform:   # module.sso_account_assignment["docs-rs-staging"].aws_ssoadmin_account_assignment.account_group_permission["infra[ViewOnlyAccess]"] will be destroyed
14:41:59.299 STDOUT terraform:   # (because key ["infra[ViewOnlyAccess]"] is not in for_each map)
14:41:59.299 STDOUT terraform:   - resource "aws_ssoadmin_account_assignment" "account_group_permission" {
14:41:59.299 STDOUT terraform:       - id                 = "e40884a8-9021-7098-ba89-1f2ab32bab88,GROUP,519825364412,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-72236e90633f0325/ps-15e41bbf18a7dd68,arn:aws:sso:::instance/ssoins-72236e90633f0325" -> null
14:41:59.299 STDOUT terraform:       - instance_arn       = "arn:aws:sso:::instance/ssoins-72236e90633f0325" -> null
14:41:59.299 STDOUT terraform:       - permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-72236e90633f0325/ps-15e41bbf18a7dd68" -> null
14:41:59.299 STDOUT terraform:       - principal_id       = "e40884a8-9021-7098-ba89-1f2ab32bab88" -> null
14:41:59.299 STDOUT terraform:       - principal_type     = "GROUP" -> null
14:41:59.299 STDOUT terraform:       - target_id          = "519825364412" -> null
14:41:59.299 STDOUT terraform:       - target_type        = "AWS_ACCOUNT" -> null
14:41:59.299 STDOUT terraform:     }
14:41:59.299 STDOUT terraform:   # module.sso_account_assignment["rust-root"].aws_ssoadmin_account_assignment.account_group_permission["infra[ReadOnlyAccess]"] will be created
14:41:59.299 STDOUT terraform:   + resource "aws_ssoadmin_account_assignment" "account_group_permission" {
14:41:59.299 STDOUT terraform:       + id                 = (known after apply)
14:41:59.299 STDOUT terraform:       + instance_arn       = "arn:aws:sso:::instance/ssoins-72236e90633f0325"
14:41:59.299 STDOUT terraform:       + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-72236e90633f0325/ps-f251e64aceea4752"
14:41:59.299 STDOUT terraform:       + principal_id       = "e40884a8-9021-7098-ba89-1f2ab32bab88"
14:41:59.299 STDOUT terraform:       + principal_type     = "GROUP"
14:41:59.299 STDOUT terraform:       + target_id          = "762490340130"
14:41:59.299 STDOUT terraform:       + target_type        = "AWS_ACCOUNT"
14:41:59.299 STDOUT terraform:     }
14:41:59.299 STDOUT terraform:   # module.sso_account_assignment["rust-root"].aws_ssoadmin_account_assignment.account_group_permission["infra[ViewOnlyAccess]"] will be destroyed
14:41:59.300 STDOUT terraform:   # (because key ["infra[ViewOnlyAccess]"] is not in for_each map)
14:41:59.300 STDOUT terraform:   - resource "aws_ssoadmin_account_assignment" "account_group_permission" {
14:41:59.300 STDOUT terraform:       - id                 = "e40884a8-9021-7098-ba89-1f2ab32bab88,GROUP,762490340130,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-72236e90633f0325/ps-15e41bbf18a7dd68,arn:aws:sso:::instance/ssoins-72236e90633f0325" -> null
14:41:59.300 STDOUT terraform:       - instance_arn       = "arn:aws:sso:::instance/ssoins-72236e90633f0325" -> null
14:41:59.300 STDOUT terraform:       - permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-72236e90633f0325/ps-15e41bbf18a7dd68" -> null
14:41:59.300 STDOUT terraform:       - principal_id       = "e40884a8-9021-7098-ba89-1f2ab32bab88" -> null
14:41:59.300 STDOUT terraform:       - principal_type     = "GROUP" -> null
14:41:59.300 STDOUT terraform:       - target_id          = "762490340130" -> null
14:41:59.300 STDOUT terraform:       - target_type        = "AWS_ACCOUNT" -> null
14:41:59.300 STDOUT terraform:     }
14:41:59.300 STDOUT terraform:   # module.sso_account_assignment["sync-team-prod"].aws_ssoadmin_account_assignment.account_group_permission["infra-admins[AdministratorAccess]"] must be replaced
14:41:59.300 STDOUT terraform: -/+ resource "aws_ssoadmin_account_assignment" "account_group_permission" {
14:41:59.300 STDOUT terraform:       ~ id                 = "f4880468-0021-707f-2472-306e771fd1ea,GROUP,189527120064,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-72236e90633f0325/ps-08eab882e6395eca,arn:aws:sso:::instance/ssoins-72236e90633f0325" -> (known after apply)
14:41:59.300 STDOUT terraform:       ~ target_id          = "189527120064" # forces replacement -> (known after apply) # forces replacement
14:41:59.300 STDOUT terraform:         # (5 unchanged attributes hidden)
14:41:59.300 STDOUT terraform:     }
14:41:59.300 STDOUT terraform:   # module.sso_account_assignment["sync-team-prod"].aws_ssoadmin_account_assignment.account_group_permission["infra-admins[ReadOnlyAccess]"] will be created
14:41:59.300 STDOUT terraform:   + resource "aws_ssoadmin_account_assignment" "account_group_permission" {
14:41:59.301 STDOUT terraform:       + id                 = (known after apply)
14:41:59.301 STDOUT terraform:       + instance_arn       = "arn:aws:sso:::instance/ssoins-72236e90633f0325"
14:41:59.301 STDOUT terraform:       + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-72236e90633f0325/ps-f251e64aceea4752"
14:41:59.301 STDOUT terraform:       + principal_id       = "f4880468-0021-707f-2472-306e771fd1ea"
14:41:59.301 STDOUT terraform:       + principal_type     = "GROUP"
14:41:59.301 STDOUT terraform:       + target_id          = (known after apply)
14:41:59.301 STDOUT terraform:       + target_type        = "AWS_ACCOUNT"
14:41:59.301 STDOUT terraform:     }
14:41:59.301 STDOUT terraform:   # module.sso_account_assignment["sync-team-prod"].aws_ssoadmin_account_assignment.account_group_permission["infra-admins[ViewOnlyAccess]"] will be destroyed
14:41:59.301 STDOUT terraform:   # (because key ["infra-admins[ViewOnlyAccess]"] is not in for_each map)
14:41:59.301 STDOUT terraform:   - resource "aws_ssoadmin_account_assignment" "account_group_permission" {
14:41:59.301 STDOUT terraform:       - id                 = "f4880468-0021-707f-2472-306e771fd1ea,GROUP,189527120064,AWS_ACCOUNT,arn:aws:sso:::permissionSet/ssoins-72236e90633f0325/ps-15e41bbf18a7dd68,arn:aws:sso:::instance/ssoins-72236e90633f0325" -> null
14:41:59.301 STDOUT terraform:       - instance_arn       = "arn:aws:sso:::instance/ssoins-72236e90633f0325" -> null
14:41:59.301 STDOUT terraform:       - permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-72236e90633f0325/ps-15e41bbf18a7dd68" -> null
14:41:59.301 STDOUT terraform:       - principal_id       = "f4880468-0021-707f-2472-306e771fd1ea" -> null
14:41:59.301 STDOUT terraform:       - principal_type     = "GROUP" -> null
14:41:59.301 STDOUT terraform:       - target_id          = "189527120064" -> null
14:41:59.301 STDOUT terraform:       - target_type        = "AWS_ACCOUNT" -> null
14:41:59.301 STDOUT terraform:     }
14:41:59.301 STDOUT terraform: Plan: 8 to add, 2 to change, 7 to destroy.
```